[
  "obsidian-git",
  "markdown-prettifier",
  "cm-editor-syntax-highlight-obsidian",
  "cycle-through-panes",
  "code-block-copy",
  "obsidian-better-codeblock",
  "obsidian-dictionary-plugin",
  "calendar",
  "table-editor-obsidian",
  "dataview",
  "obsidian-kanban",
  "obsidian-extract-pdf-highlights"
]